app/controllers/muestras_controller.rb

  def otra
   @muestras = Muestra.all
---
SELECT * FROM `muestras`

  def index
    @muestras = Muestra.all
---
SELECT * FROM `muestras`

  def show
    @muestra = Muestra.find(params[:id])
---
SELECT * FROM `muestras` WHERE (`muestras`.`id` = 0)